# 1. Вывод данных, команда print()
# 2. Ввод данных, команда input()
# 3. Переменные
# 4. Частые ошибки
# 5. Решение задач

print("Мы изучаем язык Python")
print('Мы изучаем язык Python')
###

print('Я', 'учусь', 'программировать', 'на', 'Python!')
print("Я", "учусь", "программировать", "на", "Python!")
###

print('1', '2', '4', '8', '16')

###
print('Какой хороший день!')
print('Работать мне не лень!')

###
print('Какой хороший день!')
print()
print('Работать мне не лень!')

###
print('В тексте есть "двойные" кавычки')
print("В тексте есть 'одинарные' кавычки")

###
print("I'm", 'the', "BAD", 'guy')

###
# print('12 ' 34')
# SyntaxError: unterminated string literal (detected at line 1)